app/controllers/result_controller.rb

INSERT INTO "results" ("name", "result", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Teresa"], ["result", "Bot"], ["created_at", "2021-03-17 10:12:17.996455"], ["updated_at", "2021-03-17 10:12:17.996455"]]
---
  def create
    name = params[:name]
    @result = Rps::Comparator.new(params).get_serialized_result
    result = Result.new(result: @result[:result], name: name)
    result.save!